fonecmid-diplom/src/Documents/ВМК_ГрафикОтпусков/ВМК_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВМК_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикОтпусков</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВМК_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВМК_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если Параметры.Свойство("СсылкаНаДокумент") И ЗначениеЗаполнено(Параметры.СсылкаНаДокумент) Тогда
        СсылкаНаДокумент = Параметры.СсылкаНаДокумент;
    ИначеЕсли Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
        СсылкаНаДокумент = Параметры.Ключ;
    Иначе
        Возврат;
    КонецЕсли;
    
    ДанныеДиаграммы = Неопределено;
    Если Параметры.Свойство("АдресДанныхДиаграммы") И ЗначениеЗаполнено(Параметры.АдресДанныхДиаграммы) Тогда
        ДанныеДиаграммы = ПолучитьИзВременногоХранилища(Параметры.АдресДанныхДиаграммы);
    КонецЕсли;
    
    Если ДанныеДиаграммы <> Неопределено Тогда
        ЗаполнитьДиаграммуИзВременногоХранилища(ДанныеДиаграммы);
    Иначе
        ЗаполнитьДиаграмму(СсылкаНаДокумент);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуИзВременногоХранилища(Данные)
    
    ГрафикОтпусков.Обновление = Ложь;
    ГрафикОтпусков.Очистить();

    Для Каждого Строка Из Данные Цикл
        Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник);
        Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
        ЗначениеДиагн = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
    
        Интервал = ЗначениеДиагн.Добавить();
        Интервал.Начало = Строка.ДатаНачала;
        Интервал.Конец = Строка.ДатаОкончания;
    КонецЦикла;
    
    ГрафикОтпусков.Обновление = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграмму(СсылкаНаДокумент)

    Данные = ФормированиеДиаграммы(СсылкаНаДокумент);
    ГрафикОтпусков.Обновление = Ложь;
    ГрафикОтпусков.Очистить();

    Для Каждого Строка Из Данные Цикл
        Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник);
        Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
        ЗначениеДиагн = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
    
        Интервал = ЗначениеДиагн.Добавить();
        Интервал.Начало = Строка.ДатаНачала;
        Интервал.Конец = Строка.ДатаОкончания;
    КонецЦикла;
    
    ГрафикОтпусков.Обновление = Истина;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ФормированиеДиаграммы(СсылкаНаДокумент) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ВМК_ГрафикОтпусковГрафикОтпусков.Сотрудник,
        |    ВМК_ГрафикОтпусковГрафикОтпусков.ДатаНачала,
        |    ВМК_ГрафикОтпусковГрафикОтпусков.ДатаОкончания,
        |    ВМК_ГрафикОтпусковГрафикОтпусков.Сотрудник.Специализация
        |ИЗ
        |    Документ.ВМК_ГрафикОтпусков.ГрафикОтпусков КАК ВМК_ГрафикОтпусковГрафикОтпусков
        |ГДЕ
        |    ВМК_ГрафикОтпусковГрафикОтпусков.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
    
    Возврат ВыборкаДетальныеЗаписи;

КонецФункции
